In [1]:
from IPython.display import Image
import pandas as pd
import numpy as np
import matplotlib
import matplotlib.pyplot as plt
from matplotlib import cm
import warnings
warnings.simplefilter("ignore")
%matplotlib inline

matplotlib.rcParams['figure.figsize'] = [12, 12]
from sklearn import datasets as ds
from sklearn.linear_model import LinearRegression
import tensorflow as tf

In [2]:
data_original = pd.read_json("data/dataZ_best.csv")
data = data_original

In [3]:
data.head()

,REGION_RATING_CLIENT,AMT_ANNUITY,FLAG_WORK_PHONE,CODE_GENDER,NAME_FAMILY_STATUS,REG_CITY_NOT_WORK_CITY,EXT_SOURCE_2,FLAG_EMP_PHONE,FLAG_DOCUMENT_5,LIVINGAREA_AVG,IS_KAEL
100004,I hope this data helps you.Sorry_for_not_not h...,6750.0,1,M,Single / not married,0,55.59%,1,0,-99999.0,NaN
100006,2,29686.5,0,F,Civil marriage,0,65.04%,1,0,-99999.0,0.0
100012,2,20250.0,0,M,Single / not married,0,74.66%,1,0,-99999.0,NaN
100014,2,21177.0,0,F,Married,0,65.19%,1,0,-99999.0,0.0
100015,2,10678.5,0,F,Married,0,55.52%,0,0,-99999.0,0.0

In [4]:
data.at[100004,"REGION_RATING_CLIENT"] = 2

In [5]:
data.head(10)

,REGION_RATING_CLIENT,AMT_ANNUITY,FLAG_WORK_PHONE,CODE_GENDER,NAME_FAMILY_STATUS,REG_CITY_NOT_WORK_CITY,EXT_SOURCE_2,FLAG_EMP_PHONE,FLAG_DOCUMENT_5,LIVINGAREA_AVG,IS_KAEL
100004,2,6750.0,1,M,Single / not married,0,55.59%,1,0,-99999.0000,NaN
100006,2,29686.5,0,F,Civil marriage,0,65.04%,1,0,-99999.0000,0.0
100012,2,20250.0,0,M,Single / not married,0,74.66%,1,0,-99999.0000,NaN
100014,2,21177.0,0,F,Married,0,65.19%,1,0,-99999.0000,0.0
100015,2,10678.5,0,F,Married,0,55.52%,0,0,-99999.0000,0.0
100017,2,28966.5,0,M,Married,0,56.69%,1,0,0.1397,0.0
100018,2,32778.0,0,F,Married,0,64.27%,1,0,0.3774,0.0
100019,3,20160.0,0,M,Single / not married,1,34.66%,1,0,-99999.0000,0.0
100030,2,11074.5,0,F,Married,0,65.14%,1,0,0.0670,0.0
100032,2,23827.5,0,M,Married,1,54.11%,1,0,-99999.0000,0.0

In [6]:
data["REGION_RATING_CLIENT"].value_counts()

2    73788
3    15753
1    10459
Name: REGION_RATING_CLIENT, dtype: int64

In [7]:
data["LIVINGAREA_AVG"].value_counts()
temp = data[data.LIVINGAREA_AVG >= 0]
lv_ar_mean = temp["LIVINGAREA_AVG"].mean()
lv_ar_mean

data["LIVINGAREA_AVG"][data.LIVINGAREA_AVG < 0]= lv_ar_mean

In [8]:
data["LIVINGAREA_AVG"].value_counts()

0.107732    50032
0.000000       91
0.051200       86
0.050600       77
0.050800       76
0.062600       75
0.050400       74
0.052600       73
0.070600       72
0.063600       71
0.051000       71
0.070200       71
0.054100       70
0.008200       70
0.010400       70
0.051700       69
0.053600       69
0.051400       69
0.062400       69
0.050500       68
0.063400       68
0.063000       67
0.063500       67
0.070700       67
0.008100       66
0.088000       66
0.050000       65
0.051300       65
0.050900       65
0.062200       64
            ...
0.517300        1
0.399800        1
0.380300        1
0.626800        1
0.875300        1
0.922000        1
0.455900        1
0.436400        1
0.292000        1
0.297000        1
0.520000        1
0.505300        1
0.477200        1
0.382300        1
0.437100        1
0.475500        1
0.269200        1
0.801500        1
0.321700        1
0.538100        1
0.544300        1
0.555700        1
0.247600        1
0.688600        1
0.494200        1
0.309800        1
0.326900        1
0.817700        1
0.294600        1
0.291100        1
Name: LIVINGAREA_AVG, Length: 4408, dtype: int64

So far I have fixed the first cell to have a value of 2 instead of a string and have fixed the column for the living  area avg.

In [9]:
temp2 = data["AMT_ANNUITY"].where(data.AMT_ANNUITY.isnull())
temp2.value_counts()

Series([], Name: AMT_ANNUITY, dtype: int64)

In [10]:
data["AMT_ANNUITY"].fillna(data["AMT_ANNUITY"].mean()).head(500)

100004      6750.0
100006     29686.5
100012     20250.0
100014     21177.0
100015     10678.5
100017     28966.5
100018     32778.0
100019     20160.0
100030     11074.5
100032     23827.5
100034      9000.0
100035     24592.5
100040     32895.0
100043     23157.0
100045     17338.5
100048     29196.0
100049     16258.5
100051     48280.5
100055     37255.5
100058      6750.0
100059     34596.0
100060     14661.0
100062     32472.0
100063     45558.0
100069     27265.5
100071     86989.5
100078     43983.0
100086     21775.5
100088      6750.0
100098     13500.0
            ...
101713     27792.0
101718     42142.5
101722     25537.5
101730     19066.5
101731     23404.5
101735     34825.5
101737     47965.5
101738     17608.5
101740     11250.0
101741     26217.0
101744     20565.0
101746      9000.0
101747     22500.0
101752     14742.0
101755     21919.5
101761     15075.0
101765      6187.5
101766     20079.0
101787     21294.0
101790     17154.0
101793     28111.5
101794     10462.5
101796     18396.0
101797     36774.0
101798    107356.5
101802     46827.0
101803     17905.5
101806     27832.5
101808      9000.0
101823     18306.0
Name: AMT_ANNUITY, Length: 500, dtype: float64

In [11]:
data["FLAG_WORK_PHONE"].value_counts()

0    80245
1    19755
Name: FLAG_WORK_PHONE, dtype: int64

In [12]:
data.head()

,REGION_RATING_CLIENT,AMT_ANNUITY,FLAG_WORK_PHONE,CODE_GENDER,NAME_FAMILY_STATUS,REG_CITY_NOT_WORK_CITY,EXT_SOURCE_2,FLAG_EMP_PHONE,FLAG_DOCUMENT_5,LIVINGAREA_AVG,IS_KAEL
100004,2,6750.0,1,M,Single / not married,0,55.59%,1,0,0.107732,NaN
100006,2,29686.5,0,F,Civil marriage,0,65.04%,1,0,0.107732,0.0
100012,2,20250.0,0,M,Single / not married,0,74.66%,1,0,0.107732,NaN
100014,2,21177.0,0,F,Married,0,65.19%,1,0,0.107732,0.0
100015,2,10678.5,0,F,Married,0,55.52%,0,0,0.107732,0.0

In [13]:
data["CODE_GENDER"].value_counts()

F    65888
M    34112
Name: CODE_GENDER, dtype: int64

In [14]:
data["NAME_FAMILY_STATUS"].value_counts()

Married                 63958
Single / not married    14789
Civil marriage           9611
Separated                6393
Widow                    5248
Unknown                     1
Name: NAME_FAMILY_STATUS, dtype: int64

In [15]:
data["REG_CITY_NOT_WORK_CITY"].value_counts()

0    77028
1    22972
Name: REG_CITY_NOT_WORK_CITY, dtype: int64

In [16]:
data["EXT_SOURCE_2"].head()

100004    55.59%
100006    65.04%
100012    74.66%
100014    65.19%
100015    55.52%
Name: EXT_SOURCE_2, dtype: object

In [17]:
data["EXT_SOURCE_2"].fillna(data.EXT_SOURCE_2.notnull().mean())

100004    55.59%
100006    65.04%
100012    74.66%
100014    65.19%
100015    55.52%
100017    56.69%
100018    64.27%
100019    34.66%
100030    65.14%
100032    54.11%
100034    50.28%
100035    48.00%
100040    17.25%
100043    68.17%
100045    65.08%
100048     3.73%
100049    67.42%
100051    63.15%
100055    58.92%
100058    45.08%
100059    71.34%
100060    70.59%
100062    66.29%
100063    61.66%
100069    25.67%
100071    57.07%
100078    51.73%
100086    56.99%
100088    58.52%
100098    59.71%
           ...
456184    34.87%
456187    59.94%
456195    53.43%
456196    68.01%
456198    42.20%
456199    57.52%
456205    59.08%
456207    72.44%
456210    47.98%
456211    55.49%
456213    26.45%
456214    50.27%
456215    58.32%
456217    54.78%
456219    22.60%
456227    58.99%
456228    73.97%
456233    61.53%
456234    37.84%
456235    56.12%
456236    59.92%
456237    42.47%
456239    26.78%
456242    74.63%
456244    78.94%
456245    57.55%
456246    31.33%
456249    34.64%
456252    11.60%
456253    53.57%
Name: EXT_SOURCE_2, Length: 100000, dtype: object

In [18]:
data.reset_index(level = 0, inplace = True)

In [19]:
data = data.rename(columns={'index': 'SK_ID'})

In [20]:
data.head()

,SK_ID,REGION_RATING_CLIENT,AMT_ANNUITY,FLAG_WORK_PHONE,CODE_GENDER,NAME_FAMILY_STATUS,REG_CITY_NOT_WORK_CITY,EXT_SOURCE_2,FLAG_EMP_PHONE,FLAG_DOCUMENT_5,LIVINGAREA_AVG,IS_KAEL
0,100004,2,6750.0,1,M,Single / not married,0,55.59%,1,0,0.107732,NaN
1,100006,2,29686.5,0,F,Civil marriage,0,65.04%,1,0,0.107732,0.0
2,100012,2,20250.0,0,M,Single / not married,0,74.66%,1,0,0.107732,NaN
3,100014,2,21177.0,0,F,Married,0,65.19%,1,0,0.107732,0.0
4,100015,2,10678.5,0,F,Married,0,55.52%,0,0,0.107732,0.0

In [21]:
data["FLAG_EMP_PHONE"].value_counts()

1    81965
0    18035
Name: FLAG_EMP_PHONE, dtype: int64

In [22]:
len(data["IS_KAEL"])

100000

In [23]:
#temp3 = data[data.IS_KAEL > 0]
#Is_Kael_mean = temp["IS_KAEL"].mean()

data["IS_KAEL"][data.IS_KAEL > 0]= 1

In [24]:
data["IS_KAEL"] = data["IS_KAEL"].fillna(0.07988)

In [25]:
data["IS_KAEL"].value_counts()

0.00000    69009
0.07988    25000
1.00000     5991
Name: IS_KAEL, dtype: int64

In [26]:
data["IS_KAEL"].value_counts()

0.00000    69009
0.07988    25000
1.00000     5991
Name: IS_KAEL, dtype: int64

In [27]:
data = data.to_csv("data/dataZ_best_clean_v1.csv")